<a href="https://colab.research.google.com/github/Technight27/Python-Codes-Data-Science/blob/main/Aug_23_DS_Day_6_Pandas1_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
pd.Series ([])

C:\Users\noble\AppData\Local\Temp\ipykernel_27260\3916911142.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series ([])

Series([], dtype: float64)

In [ ]:
pd.Series ([10,20,30])

0    10
1    20
2    30
dtype: int64

In [ ]:
arr1 =np.array ([10,12,14,16,18,20])
print (arr1)

[10 12 14 16 18 20]

In [ ]:
series =pd.Series(arr1)
print (series)

0    10
1    12
2    14
3    16
4    18
5    20
dtype: int32

In [ ]:
print (series[2:5])

2    14
3    16
4    18
dtype: int32

In [ ]:
print (series[2:])

2    14
3    16
4    18
5    20
dtype: int32

In [ ]:

dict1 = {'Q1':1,'Q2':2,'Q3':3,'Q4':4}
dict1

{'Q1': 1, 'Q2': 2, 'Q3': 3, 'Q4': 4}

In [ ]:
series =pd.Series (dict1)
print (series)

Q1    1
Q2    2
Q3    3
Q4    4
dtype: int64

In [ ]:
series ['Q2']

2

In [ ]:
series ['Q2':'Q4']

Q2    2
Q3    3
Q4    4
dtype: int64

In [ ]:
series

Q1    1
Q2    2
Q3    3
Q4    4
dtype: int64

In [ ]:
series ['Q3'] = 55
series

Q1     1
Q2     2
Q3    55
Q4     4
dtype: int64

In [ ]:
series ['Q3':'Q4'] = 55
series

Q1     1
Q2     2
Q3    55
Q4    55
dtype: int64

In [ ]:
list1 = [10,20,30,40,50,60]
S1= pd.Series (list1)
print (S1)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [ ]:
dataframe1 = pd.DataFrame(list1)
print (dataframe1)

    0
0  10
1  20
2  30
3  40
4  50
5  60

In [ ]:
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28}]
dataframe2=pd.DataFrame(list2)
print (dataframe2)

   Name  Age
0  John   25
1   Sam   20
2  Eric   30
3   Ken   28

In [ ]:
dataframe2 ['Name']

0    John
1     Sam
2    Eric
3     Ken
Name: Name, dtype: object

In [ ]:
dataframe2 [['Name']]

   Name
0  John
1   Sam
2  Eric
3   Ken

In [ ]:
list2 = [{'Name': ['John','Sam','Eric','Ken'],'Age':[25,20,30,28] }]
dataframe2=pd.DataFrame(list2)
print (dataframe2)

                     Name               Age
0  [John, Sam, Eric, Ken]  [25, 20, 30, 28]

In [ ]:
list2 = {'Name': ['John','Sam','Eric','Ken'],'Age':[25,20,30,28] }
dataframe2=pd.DataFrame(list2)
print (dataframe2)

   Name  Age
0  John   25
1   Sam   20
2  Eric   30
3   Ken   28

In [ ]:
dict = {'Name': ['John','Sam','Eric','Ken'],'Age':[25,20,30,28] }
dataframe2=pd.DataFrame(dict)
print (dataframe2)

   Name  Age
0  John   25
1   Sam   20
2  Eric   30
3   Ken   28

In [ ]:
list2= [['Sam', 28,5362],['Ken',32,7500], ['Eric',45,8512]]
df2 = pd.DataFrame(list2)
print (df2)

      0   1     2
0   Sam  28  5362
1   Ken  32  7500
2  Eric  45  8512

In [ ]:
list2= [['Sam', 28,5362],[32,'Ken',7500], ['Eric',45,8512]]
df2 = pd.DataFrame(list2)
print (df2)

      0    1     2
0   Sam   28  5362
1    32  Ken  7500
2  Eric   45  8512

In [ ]:
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28,'Last_Name':'Soto'}]
dataframe2=pd.DataFrame(list2)
print (dataframe2)

   Name  Age Last_Name
0  John   25       NaN
1   Sam   20       NaN
2  Eric   30       NaN
3   Ken   28      Soto

In [ ]:
list2 = [{'Name': 'John','Age':25}, {'Age':20,'Name':'Sam'},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28,'Last_Name':'Soto'}]
dataframe2=pd.DataFrame(list2)
print (dataframe2)

   Name  Age Last_Name
0  John   25       NaN
1   Sam   20       NaN
2  Eric   30       NaN
3   Ken   28      Soto

In [ ]:

data1 = {'a': pd.Series ([10,11,12],index = ['a','b','c']),'b': pd.Series ([10,11,12,13],index = ['a','b','c','d'])}
tab1 = pd.DataFrame(data1)
print (tab1)

      a   b
a  10.0  10
b  11.0  11
c  12.0  12
d   NaN  13

In [ ]:
data1 = {'a': pd.Series ([10,11,12],index = ['a','b','c']),'b': pd.Series ([10,11,12,13],index = ['a','b','c','d'])}
tab1 = pd.DataFrame(data1)
print (tab1)

      a   b
a  10.0  10
b  11.0  11
c  12.0  12
d   NaN  13

In [ ]:
pd.Series ([10,11,12],index = ['a','b','c'])

a    10
b    11
c    12
dtype: int64

In [ ]:
pd.Series ([10,11,12,13],index = ['a','b','c','d'])

a    10
b    11
c    12
d    13
dtype: int64

In [ ]:
data1 = {'a': pd.Series ([10,11,12],index = ['a','b','c']),'b': pd.Series ([10,11,12,13],index = ['a','b','c','d'])}
tab1 = pd.DataFrame(data1)
print (tab1)

      a   b
a  10.0  10
b  11.0  11
c  12.0  12
d   NaN  13

In [ ]:
data = {'one':pd.Series ([1,2,3], index = ['a','b','c']),
        'two':pd.Series ([10,15,20,30], index = ['a','b','c','d']) }
Ser= pd.DataFrame(data)
Ser

   one  two
a  1.0   10
b  2.0   15
c  3.0   20
d  NaN   30

In [ ]:
Ser ['Three'] = pd.Series ([10,15,20,30], index = ['a','b','c','d'])
Ser

   one  two  Three
a  1.0   10     10
b  2.0   15     15
c  3.0   20     20
d  NaN   30     30

In [ ]:
Ser ['Four'] = pd.Series ([50,51,52,53], index = ['c','e','a','f'])
Ser

   one  two  Three  Four
a  1.0   10     10  52.0
b  2.0   15     15   NaN
c  3.0   20     20  50.0
d  NaN   30     30   NaN

In [ ]:
data = {'one':pd.Series ([1,2,3]),
        'two':pd.Series ([10,15,20,30]) }
Ser= pd.DataFrame(data)
Ser

   one  two
0  1.0   10
1  2.0   15
2  3.0   20
3  NaN   30

In [ ]:
Ser ['Four'] = pd.Series ([50,51,52,53], index = ['c','e','a','f'])
Ser

   one  two  Four
0  1.0   10   NaN
1  2.0   15   NaN
2  3.0   20   NaN
3  NaN   30   NaN

In [ ]:
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28,'Last_Name':'Soto'}]

dataframe2=pd.DataFrame(list2)
dataframe2

   Name  Age Last_Name
0  John   25       NaN
1   Sam   20       NaN
2  Eric   30       NaN
3   Ken   28      Soto

In [ ]:
dataframe2=pd.DataFrame(list2,index  = ['Row1','Row2','Row3','Row4'])
dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row3  Eric   30       NaN
Row4   Ken   28      Soto

In [ ]:
dataframe2=pd.DataFrame(list2,index  = ['Row1','Row2','Row4'])
dataframe2

ValueError: Length of values (4) does not match length of index (3)

In [ ]:
dataframe2=pd.DataFrame(list2,index  = ['Row1','Row2','Row2','Row4'])
dataframe2

      Name  Age Last_Name
Row1  John   25       NaN
Row2   Sam   20       NaN
Row2  Eric   30       NaN
Row4   Ken   28      Soto

In [ ]:
dataframe2=pd.DataFrame(list2,index  = ['Row1','Row2',85412,'Row4'])
dataframe2

       Name  Age Last_Name
Row1   John   25       NaN
Row2    Sam   20       NaN
85412  Eric   30       NaN
Row4    Ken   28      Soto